In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import re
import matplotlib.pyplot as plt

In [2]:
%matplotlib inline
%config Inlinebackend.figure_format= 'retina'

In [3]:
sns.set_context("poster")
sns.set(rc={"figure.figsize": (13.,7.)})
sns.set_style("whitegrid")

In [4]:
df1 = pd.read_csv("../Data/scrapping.csv")

In [7]:
df1.head()

,Unnamed: 0,Paises,Medallas_Oro,Medallas_Plata,Medallas_Bronze
0,0,United States of America,39.0,41.0,33.0
1,1,People's Republic of China,38.0,32.0,18.0
2,2,Japan,27.0,14.0,17.0
3,3,Great Britain,22.0,21.0,22.0
4,4,ROC,20.0,28.0,23.0

In [8]:
df2 = pd.read_excel("../Data/Athletes.xlsx")

In [9]:
df2.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [13]:
#sns.countplot(x="NOC", data=df2, palette="magma")
#plt.xticks(rotation=45);